export default [
    {
        "id": "ijnjnji32ni2n3",
        "date": "2016-06-09T15:03:23.000Z",
        "title": "Topic",
        "text": "Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry's standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum.",
        "comments": [
            {"id": "228",
                "user": "Eugene Shadura",
                "text": "Good side Sign junior developer Evgesha!!:)"
            },
            {"id": "jn3i32b3i43",
                "user": "Kera",
                "text": "аметили фразу «fast-forward» в этом слиянии? Git просто переместил указатель ветки вперед, потому что коммит C4, на который указывает слитая ветка hotfix, был прямым потомком коммита C2, на котором вы находились до этого. Другими словами, если коммит сливается с тем, до которого можно добраться двигаясь по истории прямо, Git упрощает слияние просто перенося указатель ветки вперед, так как нет расхождений в изменениях. Это называется «fast-forward».\n" +
                    "\n" +
                    "Теперь ваши изменения включены в коммит, на котор",
            },
            {"id": "jn3i32b3i43",
                "user": "Danila",
                "text": "аметили фразу «fast-forward» в этом слиянии? Git просто переместил указатель ветки вперед, потому что коммит C4, на который указывает слитая ветка hotfix, был прямым потомком коммита C2, на котором вы находились до этого. Другими словами, если коммит сливается с тем, до которого можно добраться двигаясь по истории прямо, Git упрощает слияние просто перенося указатель ветки вперед, так как нет расхождений в изменениях. Это называется «fast-forward».\n" +
                    "\n" +
                    "Теперь ваши изменения включены в коммит, на котор",
            },{"id": "jn3i32b3i43",
                "user": "Ilia",
                "text": "аметили фразу «fast-forward» в этом слиянии? Git просто переместил указатель ветки вперед, потому что коммит C4, на который указывает слитая ветка hotfix, был прямым потомком коммита C2, на котором вы находились до этого. Другими словами, если коммит сливается с тем, до которого можно добраться двигаясь по истории прямо, Git упрощает слияние просто перенося указатель ветки вперед, так как нет расхождений в изменениях. Это называется «fast-forward».\n" +
                    "\n" +
                    "Теперь ваши изменения включены в коммит, на котор",
            },{"id": "jn3i32b3i43",
                "user": "Lesha",
                "text": "аметили фразу «fast-forward» в этом слиянии? Git просто переместил указатель ветки вперед, потому что коммит C4, на который указывает слитая ветка hotfix, был прямым потомком коммита C2, на котором вы находились до этого. Другими словами, если коммит сливается с тем, до которого можно добраться двигаясь по истории прямо, Git упрощает слияние просто перенося указатель ветки вперед, так как нет расхождений в изменениях. Это называется «fast-forward».\n" +
                    "\n" +
                    "Теперь ваши изменения включены в коммит, на котор",
            },{"id": "jn3i32b3i43",
                "user": "Maksim",
                "text": "аметили фразу «fast-forward» в этом слиянии? Git просто переместил указатель ветки вперед, потому что коммит C4, на который указывает слитая ветка hotfix, был прямым потомком коммита C2, на котором вы находились до этого. Другими словами, если коммит сливается с тем, до которого можно добраться двигаясь по истории прямо, Git упрощает слияние просто перенося указатель ветки вперед, так как нет расхождений в изменениях. Это называется «fast-forward».\n" +
                    "\n" +
                    "Теперь ваши изменения включены в коммит, на котор",
            },
        ]
    },
    {
    "id": "adasdad3",
    "date": "2016-06-09T15:03:23.000Z",
    "title": "2 Topic",
    "text": "Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry's standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum.",
    "comments": [
    {"id": "228",
        "user": "Eugene Shadura",
        "text": "Good side Sign junior developer Evgesha!!:)"
    },
    {"id": "jn3i32b3i43",
        "user": "Kera",
        "text": "аметили фразу «fast-forward» в этом слиянии? Git просто переместил указатель ветки вперед, потому что коммит C4, на который указывает слитая ветка hotfix, был прямым потомком коммита C2, на котором вы находились до этого. Другими словами, если коммит сливается с тем, до которого можно добраться двигаясь по истории прямо, Git упрощает слияние просто перенося указатель ветки вперед, так как нет расхождений в изменениях. Это называется «fast-forward».\n" +
            "\n" +
            "Теперь ваши изменения включены в коммит, на котор",
    },
    {"id": "jn3i32b3i43",
        "user": "Danila",
        "text": "аметили фразу «fast-forward» в этом слиянии? Git просто переместил указатель ветки вперед, потому что коммит C4, на который указывает слитая ветка hotfix, был прямым потомком коммита C2, на котором вы находились до этого. Другими словами, если коммит сливается с тем, до которого можно добраться двигаясь по истории прямо, Git упрощает слияние просто перенося указатель ветки вперед, так как нет расхождений в изменениях. Это называется «fast-forward».\n" +
            "\n" +
            "Теперь ваши изменения включены в коммит, на котор",
    },{"id": "jn3i32b3i43",
        "user": "Ilia",
        "text": "аметили фразу «fast-forward» в этом слиянии? Git просто переместил указатель ветки вперед, потому что коммит C4, на который указывает слитая ветка hotfix, был прямым потомком коммита C2, на котором вы находились до этого. Другими словами, если коммит сливается с тем, до которого можно добраться двигаясь по истории прямо, Git упрощает слияние просто перенося указатель ветки вперед, так как нет расхождений в изменениях. Это называется «fast-forward».\n" +
            "\n" +
            "Теперь ваши изменения включены в коммит, на котор",
    },{"id": "jn3i32b3i43",
        "user": "Lesha",
        "text": "аметили фразу «fast-forward» в этом слиянии? Git просто переместил указатель ветки вперед, потому что коммит C4, на который указывает слитая ветка hotfix, был прямым потомком коммита C2, на котором вы находились до этого. Другими словами, если коммит сливается с тем, до которого можно добраться двигаясь по истории прямо, Git упрощает слияние просто перенося указатель ветки вперед, так как нет расхождений в изменениях. Это называется «fast-forward».\n" +
            "\n" +
            "Теперь ваши изменения включены в коммит, на котор",
    },{"id": "jn3i32b3i43",
        "user": "Maksim",
        "text": "аметили фразу «fast-forward» в этом слиянии? Git просто переместил указатель ветки вперед, потому что коммит C4, на который указывает слитая ветка hotfix, был прямым потомком коммита C2, на котором вы находились до этого. Другими словами, если коммит сливается с тем, до которого можно добраться двигаясь по истории прямо, Git упрощает слияние просто перенося указатель ветки вперед, так как нет расхождений в изменениях. Это называется «fast-forward».\n" +
            "\n" +
            "Теперь ваши изменения включены в коммит, на котор",
    },
]
},
    {
        "id": "ASDADadasdad3",
        "date": "2021-06-09T15:03:23.000Z",
        "title": "3 Topic",
        "text": "Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry's standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum.",
        "comments": [
            {"id": "228",
                "user": "Eugene Shadura",
                "text": "Good side Sign junior developer Evgesha!!:)"
            },
            {"id": "jn3i32b3i43",
                "user": "Kera",
                "text": "аметили фразу «fast-forward» в этом слиянии? Git просто переместил указатель ветки вперед, потому что коммит C4, на который указывает слитая ветка hotfix, был прямым потомком коммита C2, на котором вы находились до этого. Другими словами, если коммит сливается с тем, до которого можно добраться двигаясь по истории прямо, Git упрощает слияние просто перенося указатель ветки вперед, так как нет расхождений в изменениях. Это называется «fast-forward».\n" +
                    "\n" +
                    "Теперь ваши изменения включены в коммит, на котор",
            },
            {"id": "jn3i32b3i43",
                "user": "Danila",
                "text": "аметили фразу «fast-forward» в этом слиянии? Git просто переместил указатель ветки вперед, потому что коммит C4, на который указывает слитая ветка hotfix, был прямым потомком коммита C2, на котором вы находились до этого. Другими словами, если коммит сливается с тем, до которого можно добраться двигаясь по истории прямо, Git упрощает слияние просто перенося указатель ветки вперед, так как нет расхождений в изменениях. Это называется «fast-forward».\n" +
                    "\n" +
                    "Теперь ваши изменения включены в коммит, на котор",
            },{"id": "jn3i32b3i43",
                "user": "Ilia",
                "text": "аметили фразу «fast-forward» в этом слиянии? Git просто переместил указатель ветки вперед, потому что коммит C4, на который указывает слитая ветка hotfix, был прямым потомком коммита C2, на котором вы находились до этого. Другими словами, если коммит сливается с тем, до которого можно добраться двигаясь по истории прямо, Git упрощает слияние просто перенося указатель ветки вперед, так как нет расхождений в изменениях. Это называется «fast-forward».\n" +
                    "\n" +
                    "Теперь ваши изменения включены в коммит, на котор",
            },{"id": "jn3i32b3i43",
                "user": "Lesha",
                "text": "аметили фразу «fast-forward» в этом слиянии? Git просто переместил указатель ветки вперед, потому что коммит C4, на который указывает слитая ветка hotfix, был прямым потомком коммита C2, на котором вы находились до этого. Другими словами, если коммит сливается с тем, до которого можно добраться двигаясь по истории прямо, Git упрощает слияние просто перенося указатель ветки вперед, так как нет расхождений в изменениях. Это называется «fast-forward».\n" +
                    "\n" +
                    "Теперь ваши изменения включены в коммит, на котор",
            },{"id": "jn3i32b3i43",
                "user": "Maksim",
                "text": "аметили фразу «fast-forward» в этом слиянии? Git просто переместил указатель ветки вперед, потому что коммит C4, на который указывает слитая ветка hotfix, был прямым потомком коммита C2, на котором вы находились до этого. Другими словами, если коммит сливается с тем, до которого можно добраться двигаясь по истории прямо, Git упрощает слияние просто перенося указатель ветки вперед, так как нет расхождений в изменениях. Это называется «fast-forward».\n" +
                    "\n" +
                    "Теперь ваши изменения включены в коммит, на котор",
            },
        ]
    },
    {
        "id": "ASDADaas3dasdad3",
        "date": "2021-06-09T15:03:23.000Z",
        "title": "4 Topic",
        "text": "Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry's standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum.",
        "comments": [
            {"id": "228",
                "user": "Eugene Shadura",
                "text": "Good side Sign junior developer Evgesha!!:)"
            },
            {"id": "jn3i32b3i43",
                "user": "Kera",
                "text": "аметили фразу «fast-forward» в этом слиянии? Git просто переместил указатель ветки вперед, потому что коммит C4, на который указывает слитая ветка hotfix, был прямым потомком коммита C2, на котором вы находились до этого. Другими словами, если коммит сливается с тем, до которого можно добраться двигаясь по истории прямо, Git упрощает слияние просто перенося указатель ветки вперед, так как нет расхождений в изменениях. Это называется «fast-forward».\n" +
                    "\n" +
                    "Теперь ваши изменения включены в коммит, на котор",
            },
            {"id": "jn3i32b3i43",
                "user": "Danila",
                "text": "аметили фразу «fast-forward» в этом слиянии? Git просто переместил указатель ветки вперед, потому что коммит C4, на который указывает слитая ветка hotfix, был прямым потомком коммита C2, на котором вы находились до этого. Другими словами, если коммит сливается с тем, до которого можно добраться двигаясь по истории прямо, Git упрощает слияние просто перенося указатель ветки вперед, так как нет расхождений в изменениях. Это называется «fast-forward».\n" +
                    "\n" +
                    "Теперь ваши изменения включены в коммит, на котор",
            },{"id": "jn3i32b3i43",
                "user": "Ilia",
                "text": "аметили фразу «fast-forward» в этом слиянии? Git просто переместил указатель ветки вперед, потому что коммит C4, на который указывает слитая ветка hotfix, был прямым потомком коммита C2, на котором вы находились до этого. Другими словами, если коммит сливается с тем, до которого можно добраться двигаясь по истории прямо, Git упрощает слияние просто перенося указатель ветки вперед, так как нет расхождений в изменениях. Это называется «fast-forward».\n" +
                    "\n" +
                    "Теперь ваши изменения включены в коммит, на котор",
            },{"id": "jn3i32b3i43",
                "user": "Lesha",
                "text": "аметили фразу «fast-forward» в этом слиянии? Git просто переместил указатель ветки вперед, потому что коммит C4, на который указывает слитая ветка hotfix, был прямым потомком коммита C2, на котором вы находились до этого. Другими словами, если коммит сливается с тем, до которого можно добраться двигаясь по истории прямо, Git упрощает слияние просто перенося указатель ветки вперед, так как нет расхождений в изменениях. Это называется «fast-forward».\n" +
                    "\n" +
                    "Теперь ваши изменения включены в коммит, на котор",
            },{"id": "jn3i32b3i43",
                "user": "Maksim",
                "text": "аметили фразу «fast-forward» в этом слиянии? Git просто переместил указатель ветки вперед, потому что коммит C4, на который указывает слитая ветка hotfix, был прямым потомком коммита C2, на котором вы находились до этого. Другими словами, если коммит сливается с тем, до которого можно добраться двигаясь по истории прямо, Git упрощает слияние просто перенося указатель ветки вперед, так как нет расхождений в изменениях. Это называется «fast-forward».\n" +
                    "\n" +
                    "Теперь ваши изменения включены в коммит, на котор",
            },
        ]
    },
    {
        "id": "ijnadsjnji32ni2n3",
        "date": "2016-06-09T15:03:23.000Z",
        "title": "5 Topic",
        "text": "Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry's standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum.",
        "comments": [
            {"id": "228",
                "user": "Eugene Shadura",
                "text": "Good side Sign junior developer Evgesha!!:)"
            },
            {"id": "jn3i32b3i43",
                "user": "Kera",
                "text": "аметили фразу «fast-forward» в этом слиянии? Git просто переместил указатель ветки вперед, потому что коммит C4, на который указывает слитая ветка hotfix, был прямым потомком коммита C2, на котором вы находились до этого. Другими словами, если коммит сливается с тем, до которого можно добраться двигаясь по истории прямо, Git упрощает слияние просто перенося указатель ветки вперед, так как нет расхождений в изменениях. Это называется «fast-forward».\n" +
                    "\n" +
                    "Теперь ваши изменения включены в коммит, на котор",
            },
            {"id": "jn3i32b3i43",
                "user": "Danila",
                "text": "аметили фразу «fast-forward» в этом слиянии? Git просто переместил указатель ветки вперед, потому что коммит C4, на который указывает слитая ветка hotfix, был прямым потомком коммита C2, на котором вы находились до этого. Другими словами, если коммит сливается с тем, до которого можно добраться двигаясь по истории прямо, Git упрощает слияние просто перенося указатель ветки вперед, так как нет расхождений в изменениях. Это называется «fast-forward».\n" +
                    "\n" +
                    "Теперь ваши изменения включены в коммит, на котор",
            },{"id": "jn3i32b3i43",
                "user": "Ilia",
                "text": "аметили фразу «fast-forward» в этом слиянии? Git просто переместил указатель ветки вперед, потому что коммит C4, на который указывает слитая ветка hotfix, был прямым потомком коммита C2, на котором вы находились до этого. Другими словами, если коммит сливается с тем, до которого можно добраться двигаясь по истории прямо, Git упрощает слияние просто перенося указатель ветки вперед, так как нет расхождений в изменениях. Это называется «fast-forward».\n" +
                    "\n" +
                    "Теперь ваши изменения включены в коммит, на котор",
            },{"id": "jn3i32b3i43",
                "user": "Lesha",
                "text": "аметили фразу «fast-forward» в этом слиянии? Git просто переместил указатель ветки вперед, потому что коммит C4, на который указывает слитая ветка hotfix, был прямым потомком коммита C2, на котором вы находились до этого. Другими словами, если коммит сливается с тем, до которого можно добраться двигаясь по истории прямо, Git упрощает слияние просто перенося указатель ветки вперед, так как нет расхождений в изменениях. Это называется «fast-forward».\n" +
                    "\n" +
                    "Теперь ваши изменения включены в коммит, на котор",
            },{"id": "jn3i32b3i43",
                "user": "Maksim",
                "text": "аметили фразу «fast-forward» в этом слиянии? Git просто переместил указатель ветки вперед, потому что коммит C4, на который указывает слитая ветка hotfix, был прямым потомком коммита C2, на котором вы находились до этого. Другими словами, если коммит сливается с тем, до которого можно добраться двигаясь по истории прямо, Git упрощает слияние просто перенося указатель ветки вперед, так как нет расхождений в изменениях. Это называется «fast-forward».\n" +
                    "\n" +
                    "Теперь ваши изменения включены в коммит, на котор",
            },
        ]
    },
    {
        "id": "adasdad3",
        "date": "2016-06-09T15:03:23.000Z",
        "title": "6 Topic",
        "text": "Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry's standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum.",
        "comments": [
            {"id": "228",
                "user": "Eugene Shadura",
                "text": "Good side Sign junior developer Evgesha!!:)"
            },
            {"id": "jn3i32b3i43",
                "user": "Kera",
                "text": "аметили фразу «fast-forward» в этом слиянии? Git просто переместил указатель ветки вперед, потому что коммит C4, на который указывает слитая ветка hotfix, был прямым потомком коммита C2, на котором вы находились до этого. Другими словами, если коммит сливается с тем, до которого можно добраться двигаясь по истории прямо, Git упрощает слияние просто перенося указатель ветки вперед, так как нет расхождений в изменениях. Это называется «fast-forward».\n" +
                    "\n" +
                    "Теперь ваши изменения включены в коммит, на котор",
            },
            {"id": "jn3i32b3i43",
                "user": "Danila",
                "text": "аметили фразу «fast-forward» в этом слиянии? Git просто переместил указатель ветки вперед, потому что коммит C4, на который указывает слитая ветка hotfix, был прямым потомком коммита C2, на котором вы находились до этого. Другими словами, если коммит сливается с тем, до которого можно добраться двигаясь по истории прямо, Git упрощает слияние просто перенося указатель ветки вперед, так как нет расхождений в изменениях. Это называется «fast-forward».\n" +
                    "\n" +
                    "Теперь ваши изменения включены в коммит, на котор",
            },{"id": "jn3i32b3i43",
                "user": "Ilia",
                "text": "аметили фразу «fast-forward» в этом слиянии? Git просто переместил указатель ветки вперед, потому что коммит C4, на который указывает слитая ветка hotfix, был прямым потомком коммита C2, на котором вы находились до этого. Другими словами, если коммит сливается с тем, до которого можно добраться двигаясь по истории прямо, Git упрощает слияние просто перенося указатель ветки вперед, так как нет расхождений в изменениях. Это называется «fast-forward».\n" +
                    "\n" +
                    "Теперь ваши изменения включены в коммит, на котор",
            },{"id": "jn3i32b3i43",
                "user": "Lesha",
                "text": "аметили фразу «fast-forward» в этом слиянии? Git просто переместил указатель ветки вперед, потому что коммит C4, на который указывает слитая ветка hotfix, был прямым потомком коммита C2, на котором вы находились до этого. Другими словами, если коммит сливается с тем, до которого можно добраться двигаясь по истории прямо, Git упрощает слияние просто перенося указатель ветки вперед, так как нет расхождений в изменениях. Это называется «fast-forward».\n" +
                    "\n" +
                    "Теперь ваши изменения включены в коммит, на котор",
            },{"id": "jn3i32b3i43",
                "user": "Maksim",
                "text": "аметили фразу «fast-forward» в этом слиянии? Git просто переместил указатель ветки вперед, потому что коммит C4, на который указывает слитая ветка hotfix, был прямым потомком коммита C2, на котором вы находились до этого. Другими словами, если коммит сливается с тем, до которого можно добраться двигаясь по истории прямо, Git упрощает слияние просто перенося указатель ветки вперед, так как нет расхождений в изменениях. Это называется «fast-forward».\n" +
                    "\n" +
                    "Теперь ваши изменения включены в коммит, на котор",
            },
        ]
    },
    {
        "id": "ASDADadasdad3",
        "date": "2021-06-09T15:03:23.000Z",
        "title": "7 Topic",
        "text": "Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry's standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum.",
        "comments": [
            {"id": "228",
                "user": "Eugene Shadura",
                "text": "Good side Sign junior developer Evgesha!!:)"
            },
            {"id": "jn3i32b3i43",
                "user": "Kera",
                "text": "аметили фразу «fast-forward» в этом слиянии? Git просто переместил указатель ветки вперед, потому что коммит C4, на который указывает слитая ветка hotfix, был прямым потомком коммита C2, на котором вы находились до этого. Другими словами, если коммит сливается с тем, до которого можно добраться двигаясь по истории прямо, Git упрощает слияние просто перенося указатель ветки вперед, так как нет расхождений в изменениях. Это называется «fast-forward».\n" +
                    "\n" +
                    "Теперь ваши изменения включены в коммит, на котор",
            },
            {"id": "jn3i32b3i43",
                "user": "Danila",
                "text": "аметили фразу «fast-forward» в этом слиянии? Git просто переместил указатель ветки вперед, потому что коммит C4, на который указывает слитая ветка hotfix, был прямым потомком коммита C2, на котором вы находились до этого. Другими словами, если коммит сливается с тем, до которого можно добраться двигаясь по истории прямо, Git упрощает слияние просто перенося указатель ветки вперед, так как нет расхождений в изменениях. Это называется «fast-forward».\n" +
                    "\n" +
                    "Теперь ваши изменения включены в коммит, на котор",
            },{"id": "jn3i32b3i43",
                "user": "Ilia",
                "text": "аметили фразу «fast-forward» в этом слиянии? Git просто переместил указатель ветки вперед, потому что коммит C4, на который указывает слитая ветка hotfix, был прямым потомком коммита C2, на котором вы находились до этого. Другими словами, если коммит сливается с тем, до которого можно добраться двигаясь по истории прямо, Git упрощает слияние просто перенося указатель ветки вперед, так как нет расхождений в изменениях. Это называется «fast-forward».\n" +
                    "\n" +
                    "Теперь ваши изменения включены в коммит, на котор",
            },{"id": "jn3i32b3i43",
                "user": "Lesha",
                "text": "аметили фразу «fast-forward» в этом слиянии? Git просто переместил указатель ветки вперед, потому что коммит C4, на который указывает слитая ветка hotfix, был прямым потомком коммита C2, на котором вы находились до этого. Другими словами, если коммит сливается с тем, до которого можно добраться двигаясь по истории прямо, Git упрощает слияние просто перенося указатель ветки вперед, так как нет расхождений в изменениях. Это называется «fast-forward».\n" +
                    "\n" +
                    "Теперь ваши изменения включены в коммит, на котор",
            },{"id": "jn3i32b3i43",
                "user": "Maksim",
                "text": "аметили фразу «fast-forward» в этом слиянии? Git просто переместил указатель ветки вперед, потому что коммит C4, на который указывает слитая ветка hotfix, был прямым потомком коммита C2, на котором вы находились до этого. Другими словами, если коммит сливается с тем, до которого можно добраться двигаясь по истории прямо, Git упрощает слияние просто перенося указатель ветки вперед, так как нет расхождений в изменениях. Это называется «fast-forward».\n" +
                    "\n" +
                    "Теперь ваши изменения включены в коммит, на котор",
            },
        ]
    },
    {
        "id": "ASDADaas3dasdad3",
        "date": "2021-06-09T15:03:23.000Z",
        "title": "8 Topic",
        "text": "Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry's standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum.",
        "comments": [
            {"id": "228",
                "user": "Eugene Shadura",
                "text": "Good side Sign junior developer Evgesha!!:)"
            },
            {"id": "jn3i32b3i43",
                "user": "Kera",
                "text": "аметили фразу «fast-forward» в этом слиянии? Git просто переместил указатель ветки вперед, потому что коммит C4, на который указывает слитая ветка hotfix, был прямым потомком коммита C2, на котором вы находились до этого. Другими словами, если коммит сливается с тем, до которого можно добраться двигаясь по истории прямо, Git упрощает слияние просто перенося указатель ветки вперед, так как нет расхождений в изменениях. Это называется «fast-forward».\n" +
                    "\n" +
                    "Теперь ваши изменения включены в коммит, на котор",
            },
            {"id": "jn3i32b3i43",
                "user": "Danila",
                "text": "аметили фразу «fast-forward» в этом слиянии? Git просто переместил указатель ветки вперед, потому что коммит C4, на который указывает слитая ветка hotfix, был прямым потомком коммита C2, на котором вы находились до этого. Другими словами, если коммит сливается с тем, до которого можно добраться двигаясь по истории прямо, Git упрощает слияние просто перенося указатель ветки вперед, так как нет расхождений в изменениях. Это называется «fast-forward».\n" +
                    "\n" +
                    "Теперь ваши изменения включены в коммит, на котор",
            },{"id": "jn3i32b3i43",
                "user": "Ilia",
                "text": "аметили фразу «fast-forward» в этом слиянии? Git просто переместил указатель ветки вперед, потому что коммит C4, на который указывает слитая ветка hotfix, был прямым потомком коммита C2, на котором вы находились до этого. Другими словами, если коммит сливается с тем, до которого можно добраться двигаясь по истории прямо, Git упрощает слияние просто перенося указатель ветки вперед, так как нет расхождений в изменениях. Это называется «fast-forward».\n" +
                    "\n" +
                    "Теперь ваши изменения включены в коммит, на котор",
            },{"id": "jn3i32b3i43",
                "user": "Lesha",
                "text": "аметили фразу «fast-forward» в этом слиянии? Git просто переместил указатель ветки вперед, потому что коммит C4, на который указывает слитая ветка hotfix, был прямым потомком коммита C2, на котором вы находились до этого. Другими словами, если коммит сливается с тем, до которого можно добраться двигаясь по истории прямо, Git упрощает слияние просто перенося указатель ветки вперед, так как нет расхождений в изменениях. Это называется «fast-forward».\n" +
                    "\n" +
                    "Теперь ваши изменения включены в коммит, на котор",
            },{"id": "jn3i32b3i43",
                "user": "Maksim",
                "text": "аметили фразу «fast-forward» в этом слиянии? Git просто переместил указатель ветки вперед, потому что коммит C4, на который указывает слитая ветка hotfix, был прямым потомком коммита C2, на котором вы находились до этого. Другими словами, если коммит сливается с тем, до которого можно добраться двигаясь по истории прямо, Git упрощает слияние просто перенося указатель ветки вперед, так как нет расхождений в изменениях. Это называется «fast-forward».\n" +
                    "\n" +
                    "Теперь ваши изменения включены в коммит, на котор",
            },
        ]
    }
]